#include <iostream>

using namespace std;

int main1() {


    /*
     * 数组特点：
     * 放在一块连续的内存空间中，数组中的每个元素都是相同的数据类型
     *
     * 一维数组
     * 三种定义方式：
     * 1. 数据类型 数组名[数组长度]
     * 2. 数据类型 数组名[数组长度] = {值1， 值2， 值3 ...}
     * 3. 数据类型 数组名[] = {值1，值2，值3...}
     */

    //1. 数据类型 数组名[数组长度]
    int arr1[5];
    arr1[0] = 10;
    arr1[1] = 20;
    arr1[2] = 30;
    arr1[3] = 40;
    arr1[4] = 50;
    cout << arr1[0] << endl;


    //2. 数组类型 数组名[数组长度] = {值1，值2...}
    //如果初始化数据是，没有全部填写完，其他值默认为0
    int arr2[5] = {10, 20, 30};
    for (int i = 0; i < 5; ++i) {
        cout << arr2[i] << endl; // 10,20,30,0,0
    }


    //3. 数组类型 数组名[]= {值1，值2，值3...}
    int arr3[] = {1, 2, 3, 4, 5, 6, 7};
    for (int i = 0; i < 7; ++i) {
        cout << arr3[i] << endl;
    }
    return 0;
}